#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_test.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=dd749b5f-13c6-4221-bc92-098523ca8ca2]
module.keycloak_test.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7ab84a8a-0382-44eb-b424-c7c8aa878c3c]
module.keycloak_test.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=73e55553-174f-4151-94ec-f6767f04adb7]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=8878cff1-1348-4e40-ac4c-e86cbef10953]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8793c98f-faaa-494f-b0d6-f70eddff4110]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=88d1a623-39ab-42c0-8257-e47b209da2dc]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=acfa69d8-7904-4142-8e82-217b60cd9045]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7a8fcd62-601e-4cfc-a547-5ba48fa7e66a]
module.keycloak_test.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=75c9af51-b1c8-4786-b358-6589edd18975]
module.keycloak_test.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e4330355-a7b5-4bbf-b9b4-54db65deb58a]
module.keycloak_test.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=9df50690-40eb-430e-a01d-c6f211b782e8]
module.keycloak_test.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=68611353-ed6f-4be6-a25a-c3d794c5e449]
module.keycloak_test.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=098aaf25-e9cf-4e19-9c80-d09f57439190]
module.keycloak_test.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=896650bc-732d-4a5f-8ac1-cf25fbe4de68]
module.keycloak_test.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=635f3fb9-d749-4803-bcff-0be9eab3aa2b]
module.keycloak_test.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=46fb71bf-f2e8-4548-a984-f20bc08ac9f2]
module.keycloak_test.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c0396af9-eb57-4905-86d2-0ff49a84d025]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=25b5beb0-871c-4ca5-8b06-fcf3b629f729]
module.keycloak_test.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=310aa852-e112-498b-90a2-fca7b3571c90]
module.keycloak_test.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b84511c6-636e-4319-8692-f9554ac6b2fa]
module.keycloak_test.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=98a68b31-516c-47eb-9a8d-b753d24873a8]
module.keycloak_test.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0bce5a19-b7c5-4478-b25f-473be97c3ebf]
module.keycloak_test.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7f3e84a3-5a99-4d90-a750-73db699b2661]
module.keycloak_test.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ced38f6e-9e3c-4b2e-8194-93854afb9030]
module.keycloak_test.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=199df10e-daf5-4ee8-8f6a-a150fdab68c1]
module.keycloak_test.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6371aa88-9047-43f0-8b5d-43ce1fc60241]
module.keycloak_test.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=6dc52ff6-3381-4900-b272-4819d183ba03]
module.keycloak_test.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=03975245-a356-4534-b7fb-9785adb765f5]
module.keycloak_test.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=cebbc3f8-eeff-47cb-8e10-ff6a7756a208]
module.keycloak_test.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3a22bf8a-4dfe-4929-bce1-f0717aae4d88]
module.keycloak_test.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=9b6f1b8f-e692-4023-b092-c3bcad8f575a]
module.keycloak_test.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=3dd41f1b-e207-443e-b8d3-cf9946565ff5]
module.keycloak_test.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=388101ea-ac10-43f0-88a1-c80f7ae2267d]
module.keycloak_test.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0cd6914f-df94-436f-b89c-e51f5cb29448]
module.keycloak_test.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=09267776-dbc9-4023-a495-244cf1c5b35d]
module.keycloak_test.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=250f8222-db76-469b-9379-e97c9df7970f]
module.keycloak_test.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=16f0a6f9-b53b-42c1-a9ae-f25094901d27]
module.keycloak_test.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d4041a7f-970a-4b02-8ca1-318a779f28d7]
module.keycloak_test.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d9f74a4f-67b0-48bf-a02c-404a54728572]
module.keycloak_test.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=78d9758c-bf06-4fe0-8950-401ae43c2861]
module.keycloak_test.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3d40d307-f367-40a9-a948-6d24f1d1eae2]
module.keycloak_test.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=bd93bf1a-1da7-4794-9068-f8039a487114]
module.keycloak_test.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7a398cc7-32b7-4f13-a031-01ca806502a9]
module.keycloak_test.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=7e3f9e8c-c5a1-48c6-ab24-bf6531fcccff]
module.keycloak_test.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b7f16c72-655e-4bae-a3f1-adbe94fe32db]
module.keycloak_test.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=bc774e55-0fc5-41e6-a4f0-360c898f1296]
module.keycloak_test.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=614dac07-8e3d-4581-90bc-55c855829de8]
module.keycloak_test.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=26f898b3-2452-4764-9f3a-833f3b79c90a]
module.keycloak_test.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=22fcfb4b-929f-418c-8df4-2ac5df373a7d]
module.keycloak_test.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=cd192d0a-0723-44fd-872b-0df7a004c787]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=935ff7cb-a126-4216-ad71-45da47f82ac5]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d7ad910e-c22c-4eed-8efc-39d6d6f9edfa]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4cd357f0-ebcc-4204-a6e6-2b29c134640a]
module.keycloak_test.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=63ba2f70-5b54-4299-a638-2e66b1caba54]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e64a3f75-96b4-4a39-b0e5-8d899cc20e64]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bb437a3f-248d-480b-b6e9-03618f1baea6]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ad9328cc-f535-4f7f-869f-207443949070]
module.keycloak_test.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d5c93604-e0e3-4740-9584-84b066ab9120]
module.keycloak_test.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=60037fdc-5984-4338-a1d2-ab18d803f7dc]
module.keycloak_test.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5453fa64-0eb4-43b1-8304-3efdad04aac0]
module.keycloak_test.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e4ad53bd-0fb8-42ca-bd95-3d5d0cbb1b23]
module.keycloak_test.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=f993fd89-ed2c-4f65-93f8-f559c4714a5b]
module.keycloak_test.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b00afd3a-9b76-43ce-9e34-cfb05071c8f2]
module.keycloak_test.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=bf745114-72b7-4eef-a6b7-1280ac5330e2]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a2bcf65c-da6e-4f30-b363-a912f862f75b]
module.keycloak_test.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ab008a0e-4343-4fb9-86a5-e2e100e2d3b1]
module.keycloak_test.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=79ba1965-8d2e-47f4-ac9a-89708aef294a]
module.keycloak_test.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=128ab502-3de4-49f9-860f-43dd51b718a6]
module.keycloak_test.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=e4f1242b-dc64-4b57-8d67-140d8d85c15f]
module.keycloak_test.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=2e0a3f47-e874-4d2d-9b97-209f2e98f43d]
module.keycloak_test.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=36e09f0c-40be-4e2f-95ce-b8dcd4c35f97]
module.keycloak_test.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b420f75e-a0bf-4d05-9de3-cc9e45143f0e]
module.keycloak_test.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c0951d96-ab87-40ac-9cae-30b28ed6412f]
module.keycloak_test.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=22a838d1-8915-4cf3-86de-c9125fd911d4]
module.keycloak_test.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=39ac38de-9c6c-4087-9d27-b7cd72ff70a3]
module.keycloak_test.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=2f7385df-6585-4047-8405-51d53594e39d]
module.keycloak_test.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8e6c9aff-1d06-4ed3-aa54-aaabbd46f87c]
module.keycloak_test.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f782eed5-8d94-4f88-a917-a360345c7d49]
module.keycloak_test.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=98257532-2f9e-41c9-9b21-929b56a5640e]
module.keycloak_test.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c387e725-c7e0-4b7b-bd20-50110511e794]
module.keycloak_test.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f2e58cd1-ea1c-40f2-aee1-95b7d0dfda6f]
module.keycloak_test.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=22a6f133-33f4-454f-a068-1dc515efca02]
module.keycloak_test.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a0d8d0eb-cf11-4b26-891c-efcd90d18211]
module.keycloak_test.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a06188b8-bfd7-4421-9fea-10ade74c9300]
module.keycloak_test.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=dfd35c3d-dd00-4373-b997-4841a84fa4df]
module.keycloak_test.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=17043549-e436-4a06-8020-13f14a90349d]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=71fea1dd-088b-4229-beca-942e3b584708]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f11c2030-4e36-44ca-87f6-98b74e7adc49]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=625e613f-a43d-4b0c-8753-b584047abd0a]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=aa153c2c-6175-47f4-9705-3dea60504274]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=cbea4edb-dd3e-42e5-b050-a274d6b6fe04]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=cf3cd2ae-a2fb-4c1b-8056-79059a5fbbd2]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=06881f5a-9a2a-446d-8330-ecc60c3a7c9d]
module.keycloak_test.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=644fc2bd-7ab6-451c-b5f1-79d1e80687cf]
module.keycloak_test.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=2f20c305-2753-4634-9ed1-3b0423440b76]
module.keycloak_test.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c157fbc8-b72b-4f28-9442-f2eae59d388e]
module.keycloak_test.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=711e0d2a-4c9a-4920-b06e-00d0c69087d2]
module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b5eecca9-8296-4e83-87e1-2d3ed2d12889]
module.keycloak_test.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6fbe708d-8188-4257-bbf5-e4061824135c]
module.keycloak_test.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=51da3ae1-9ccd-406e-9e42-90389145a322]
module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a40e70fa-078d-4d39-bee6-89e22adbc6a1]
module.keycloak_test.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=dc228830-3ed4-4a65-a266-4a976df4ad0c]
module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d30cd9ba-b0ec-40fc-a6c6-3bbc320e82a8]
module.keycloak_test.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4eac1ac7-a1ad-42c9-93a0-19394946574f]
module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5b509105-1006-4af4-a6b1-e4aabea28bfa]
module.keycloak_test.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c028139a-3857-419d-bb09-5db4be47f41d]
module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6a02511e-ee3f-41ab-ab18-879f6a4668b8]
module.keycloak_test.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=4394583c-9717-4f08-be88-cc7d4203da0f]
module.keycloak_test.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=6cdcb5eb-76fa-4dab-9d1a-9cff0a876044]
module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9a9a72df-dc1e-4b03-ab2d-9d0b8f869849]
module.keycloak_test.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=4a12fe30-d016-4074-934e-32ea85f2355f]
module.keycloak_test.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f75359cc-6ace-421f-bb3c-3f1ea5260922]
module.keycloak_test.module.onestopauth.module.client_august-17-4-pm-2-600.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=12b576dc-ed2b-481b-9b20-a6fc4580049e]
module.keycloak_test.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e23d1def-43d1-40c5-b9c5-d3b73e37d35b]
module.keycloak_test.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=154c7e61-adef-4b3e-b333-b72c9d6cf98e]
module.keycloak_test.module.onestopauth.module.client_august-17-4-pm-2-600.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=df452b23-0127-4bac-9389-f824250bc035]
module.keycloak_test.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b554d38b-02b3-46ae-9ce5-ae45f4dbf3b6]
module.keycloak_test.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=eb162d82-50b9-4e22-8a22-116f9cefd88e]
module.keycloak_test.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e709d992-20ff-4fea-afcf-bb05ace4c271]
module.keycloak_test.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b67da5d8-12e7-4eb3-b9bd-c3d5d5f27187]
module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=eacdc94e-44cc-46b7-afa2-66c49675bd87]
module.keycloak_test.module.onestopauth.module.client_august-17-4-pm-2-600.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=47df31df-63fe-41b9-a08c-639057bc62ad]
module.keycloak_test.module.onestopauth.module.client_august-17-4-pm-2-600.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=31ab8a6d-c029-4ca8-8c0d-5d9f527e053d]
module.keycloak_test.module.onestopauth.module.client_august-17-4-pm-2-600.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=bd3b3d64-f583-4d6a-bb67-5ac8662cdbbe]
module.keycloak_test.module.onestopauth.module.client_august-17-4-pm-2-600.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a8c52289-4428-4219-8ab7-d1684a4d0780]
module.keycloak_test.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8c1a1865-eb56-4846-8f8c-6911d52d753a]
module.keycloak_test.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b6dbc737-3b72-457c-b509-159b81abe69b]
module.keycloak_test.module.onestopauth.module.client_august-17-4-pm-2-600.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f777917d-834e-4424-855d-51f93c2a63a1]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "0fd6e2c3-192d-4b4b-84f6-e89e7782e781"
        name                                     = "zz-3169"
      + web_origins                              = []
        # (14 unchanged attributes hidden)
    }
  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3169.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "f06c36c1-cce7-4fdc-af00-f19139db0114"
        name                                     = "zz-3169"
      + web_origins                              = []
        # (14 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-3202.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "bceid-test-3202"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-3202.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-3202.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-3202.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-3202.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "bceid-test-3202"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-3202.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-3202.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-3202.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "bceid-test-3202"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "bceid-test-3202"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://a",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-3202.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "bceid-test-3202"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-3202.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-3202.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-3202.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-3202.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "bceid-test-3202"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-3202.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-3202.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-3202.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "bceid-test-3202"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "bceid-test-3202"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://b",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 16 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 2952 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*